Rafa350/EOS/v2/Source/HTL/STM32/htlUART.cpp
#include "HTL/htl.h"
#include "HTL/STM32/htlClock.h"
#include "HTL/STM32/htlUART.h"


using namespace htl;
using namespace htl::uart;
using namespace htl::clock;


static void setParity(USART_TypeDef *usart, Parity parity);
static void setWordBits(USART_TypeDef *usart, WordBits wordBits, bool useParity);
static void setStopBits(USART_TypeDef *usart, StopBits stopBits);
static void setHandsake(USART_TypeDef *usart, Handsake handsake);
static void setReceiveTimeout(USART_TypeDef *usart, uint32_t timeout);

static ClockSource getClockSource(USART_TypeDef *usart);
static unsigned getClockFrequency(USART_TypeDef *usart, ClockSource clockSource);


/// ----------------------------------------------------------------------
/// \brief    Constructor.
/// \param    usart: Registres hardware del modul USART.
///
UARTDevice::UARTDevice(
	USART_TypeDef *usart):

	_usart {usart},
	_state {State::reset},
	_notifyEvent {nullptr},
	_notifyEventEnabled {false},
	_dmaNotifyEvent {*this, &UARTDevice::dmaNotifyEventHandler} {

}


/// ----------------------------------------------------------------------
/// \brief    Inicialitza el modul UART.
/// \return   El resultat de l'operacio.
///
Result UARTDevice::initialize() {

	if (_state == State::reset) {

		activate();

		_usart->CR1 &= ~(
			#if defined(EOS_PLATFORM_STM32G0)
			USART_CR1_FIFOEN | // Deshabilita el FIFO
			#endif
			USART_CR1_UE |     // Desabilita el dispositiu
			USART_CR1_TE |     // Desabilita la transmissio
			USART_CR1_RE);     // Deshabilita la recepcio
	    _usart->CR2 &= ~(
	    	USART_CR2_LINEN |  // Modus sincron, deshabilita LIN
			USART_CR2_CLKEN);  // ;odus sincron, desabilita CLK
		_usart->CR3 &= ~(
			USART_CR3_SCEN |   // Desabilita smartcad
			USART_CR3_HDSEL |  // Desabilita half-duplex
			USART_CR3_IREN);   // Desabilita IRDA
		_usart->CR1 |= USART_CR1_UE; // Habilita el dispositiu de nou

		_state = State::ready;

		return Result::success();
	}

	else
		return Result::error();
}


/// ----------------------------------------------------------------------
/// \brief    Desinicialitza el modul.
/// \return   El resultat de l'operacio.
///
Result UARTDevice::deinitialize() {

	if (_state == State::ready) {

		_usart->CR1 = 0;
		_usart->CR2 = 0;
		_usart->CR3 = 0;

		deactivate();

		_state = State::reset;

		return Result::success();
	}

	else
		return Result::error();
}


/// ----------------------------------------------------------------------
/// \brief    Selecciona el protocol de comunicacio.
/// \param    wordBits: Les opcions de paraula.
/// \param    parity: Les opcions de paritat.
/// \param    stopBits: Les opcions de parada.
/// \param    handsake: Protocol.
///
void UARTDevice::setProtocol(
	WordBits wordBits,
	Parity parity,
	StopBits stopBits,
	Handsake handsake) {

	if (_state == State::ready) {
		setParity(_usart, parity);
		setWordBits(_usart, wordBits, parity != Parity::none);
		setStopBits(_usart, stopBits);
		setHandsake(_usart, handsake);
		setReceiveTimeout(_usart, 11 * 100);
	}
}


/// ----------------------------------------------------------------------
/// \brief    Asigna el valor del timeout per recepcio.
/// \param    timeout: El temps.
///
void UARTDevice::setRxTimeout(
    uint32_t timeout) {

	if (_state == State::ready)
		setReceiveTimeout(_usart, timeout);
}



/// ----------------------------------------------------------------------
/// \brief    Asigna els valor de temporitzacio.
/// \param    baudMode: Les opcions del baud rate
/// \param    clockSource: Les opcions de clocking.
/// \param    rate: El valor de velocitat.
/// \param    overSampling: Tipus de mostreig
///
void UARTDevice::setTimming(
	BaudMode baudMode,
	ClockSource clockSource,
	uint32_t rate,
	OverSampling overSampling) {

	if (_state == State::ready) {
		switch (baudMode) {
			case BaudMode::_1200:
				rate = 1200;
				break;

			case BaudMode::_2400:
				rate = 2400;
				break;

			case BaudMode::_4800:
				rate = 4800;
				break;

			case BaudMode::_9600:
				rate = 9600;
				break;

			case BaudMode::_19200:
				rate = 19200;
				break;

			case BaudMode::_38400:
				rate = 38400;
				break;

			case BaudMode::_57600:
				rate = 57600;
				break;

			case BaudMode::_115200:
				rate = 115200;
				break;

			default:
				break;
		}

		if (clockSource == ClockSource::automatic)
			clockSource = getClockSource(_usart);

		uint32_t fclk = getClockFrequency(_usart, clockSource);

		uint32_t div;
		if (baudMode == BaudMode::div)
			div = rate;
		else {
			if (overSampling == OverSampling::_8)
				div = (fclk + fclk + (rate / 2)) / rate;
			else
				div = (fclk + (rate / 2)) / rate;
		}

		if (overSampling == OverSampling::_8) {
			uint32_t temp = (uint16_t)(div & 0xFFF0U);
			temp |= (uint16_t)((div & (uint16_t)0x000FU) >> 1U);
			_usart->BRR = temp;
		}
		else
			_usart->BRR = div;
	}
}


/// ----------------------------------------------------------------------
/// \brief    Asigna l'event de notificacio.
/// \param    event: L'event.
/// \param    enabled: Indica si l'habilita.
///
void UARTDevice::setNotifyEvent(
	INotifyEvent &event,
	bool enabled) {

	if (_state == State::ready) {
		_notifyEvent = &event;
		_notifyEventEnabled = enabled;
	}
}


/// ----------------------------------------------------------------------
/// \brief    Inicia la transmissio d'un bloc de dades per interrupcions.
/// \param    buffer: Buffer de dades.
/// \param    length: El nombre de bytes a transmetre.
/// \return   El resultat de l'operacio
///
Result UARTDevice::transmit_IRQ(
	const uint8_t *buffer,
	unsigned length) {

	if (_state == State::ready) {

		_state = State::transmiting;

		_txBuffer = buffer;
		_txCount = 0;
        _txMaxCount = length;

        // Habilita comunicacio, interrupcions, rtc
        //
		_usart->CR1 |=
			USART_CR1_TE |            // Habilita la transmissio
			USART_CR1_TXEIE_TXFNFIE;  // Habilita interrupcio TXE

		return Result::success();
	}

	else if ((_state == State::transmiting) || (_state == State::receiving))
		return Result::busy();

	else
		return Result::error();
}


